---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.HasCurrent
source: html/2e236a2a-52b2-4371-b1eb-f49c2f590267.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.HasCurrent Method

Identifies if the iterator has a current item.

## Syntax (C#)
```csharp
public bool HasCurrent()
```

## Returns
True if there is a current item.

## Remarks
There is no current item if the iterator has not started yet or has been done.